Обработки/Reports/_ДвиженияЦБПоСделкамМеждуДатамиФиксацииИПогашения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ДвиженияЦБПоСделкамМеждуДатамиФиксацииИПогашения</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетСодержитДанные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ДвиженияЦБПоСделкамМеждуДатамиФиксацииИПогашения/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Движения ценных бумаг по сделкам в период между датами фиксации и погашения купона и тела облигаций",
		"0.38",
		"",
		Истина
	);
		
	// Команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "АвтоОтправкаОтчета_РЭМ", "Регион ЭсМ, за неделю назад" , , Ложь, "ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "АвтоОтправкаОтчета_ПИ", "Регион ПИ, за неделю назад", , Ложь, "ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "АвтоОтправкаОтчета_ТрастМ", "Регион Траст М, за неделю назад", , Ложь, "ВызовСерверногоМетода");
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

// Интерфейс для формирования отчета и отправки на почту по регламентному заданию
//
// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//        элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	Перем Адресаты, Ошибки, ПриВыполненииВозниклиОшибки;	
	
	Ошибки = Новый Массив();
	ПриВыполненииВозниклиОшибки = Ложь;
	
	// Обрабатываем только известные команды
	Если Лев(ИдентификаторКоманды, 18) <> "АвтоОтправкаОтчета" Тогда
		ПриВыполненииВозниклиОшибки = Истина;
		Ошибки.Добавить("Неизвестный идентификатор команды """ + ИдентификаторКоманды + """");
	КонецЕсли;
	
	// Заполним параметры команды
	Если Не ПриВыполненииВозниклиОшибки Тогда
		ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды);
		Если Не ПараметрыКоманды.Свойство("Организация", ЭтотОбъект.Организация) ИЛИ Не ЗначениеЗаполнено(ЭтотОбъект.Организация) Тогда
			ПриВыполненииВозниклиОшибки = Истина;
			Ошибки.Добавить("Не указан или не заполнен параметр ""Организация""");
		КонецЕсли;
		Если Не ПараметрыКоманды.Свойство("Адресаты", Адресаты) ИЛИ Не ЗначениеЗаполнено(Адресаты) Тогда
			ПриВыполненииВозниклиОшибки = Истина;
			Ошибки.Добавить("Не указан или не заполнен параметр ""Адресаты""");
		КонецЕсли;
		ЭтотОбъект.Период.ДатаОкончания	= НачалоДня(ТекущаяДата())-1; // Конец вчерашнего дня
		ЭтотОбъект.Период.ДатаНачала	= НачалоДня(ЭтотОбъект.Период.ДатаОкончания) - 604800; // Минус неделя
	КонецЕсли;
		
	// Формируем отчет
	Если Не ПриВыполненииВозниклиОшибки Тогда
		Отчет = Новый ТабличныйДокумент;
		ЭтотОбъект.СкомпоноватьРезультат(Отчет);
		
		//// Если отчет пустой, его не отправляем
		//ВысотаШапки = 9;
		//ОтчетСодержитДанные = (Отчет.ВысотаТаблицы > ВысотаШапки);
		
		// Сохраняем отчет в PDF и отправляем его адресатам
		Если ЭтотОбъект.ОтчетСодержитДанные Тогда
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".pdf");
			Отчет.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
			
			Вложения = Новый Соответствие;
			Вложения.Вставить("Отчет " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy") + ".pdf", Новый Файл(ИмяВременногоФайла));
			
			Попытка
				РаботаСЭлектроннойПочтой.ОтправитьПростоеЭлектронноеПисьмо(
					Адресаты,
					"Движения ценных бумаг по сделкам в период между датами фиксации и погашения купона и тела облигаций за " + Строка(ЭтотОбъект.Период) + " по " + Строка(ЭтотОбъект.Организация),
					"Отчет о движении ценных бумаг по сделкам в период между датами фиксации и погашения купона и тела облигаций за " + Строка(ЭтотОбъект.Период) + " по " + Строка(ЭтотОбъект.Организация),
					Вложения,
					РаботаСЭлектроннойПочтой.ПолучитьСистемнуюУчетнуюЗапись(),
					Ложь
				);
			Исключение
				ПриВыполненииВозниклиОшибки = Истина;
				Ошибки.Добавить("Ошибка отправки отчета на электронную почту: " + ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	// Если были ошибки, сохраняем их
	Если ПриВыполненииВозниклиОшибки Тогда
		РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(Ошибки, ПараметрыОбработки.ДополнительнаяОбработкаСсылка);
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьКоманду

// Компоновка отчета
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	Перем ПараметрыДанных;

	// Организуем сбор статистики
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ПриКомпоновкеРезультата()";
    Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
			Механизм,
			ПараметрыВыполненияДляСбораСтатистики.Хранилище,
			ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	// Заполняем параметры СКД
	ПараметрыДанных = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных;
	
	ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода",НачалоДня(ЭтотОбъект.Период.ДатаНачала));
	ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода",КонецДня(ЭтотОбъект.Период.ДатаОкончания));
	ПараметрыДанных.УстановитьЗначениеПараметра("Организация",ЭтотОбъект.Организация);		
	
	// Ручная компоновка отчета для определения, есть ли в отчете данные или он пустой.
	СтандартнаяОбработка = Ложь;
	
	РезультатУспешно = 1;
	РезультатОшибка  = 2;
	
	РезультатПроверки = РезультатОшибка;	
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;	
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(ЭтотОбъект.СхемаКомпоновкиДанных, ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
	
	ПроцессорКомпоновки	= Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновкиДанных, , ДанныеРасшифровки, Истина);
		
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	// Выводим данные
	ПроцессорВывода.НачатьВывод();
	Пока Истина Цикл
		
		ЭлементРезультата = ПроцессорКомпоновки.Следующий();
		Если ЭлементРезультата = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		Если РезультатПроверки <> РезультатУспешно Тогда
			Если ЭлементРезультата.ЗначенияПараметров.Количество() Тогда
				РезультатПроверки = РезультатУспешно;
			КонецЕсли;				
		КонецЕсли;
		
	    ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
		
	КонецЦикла;
	ПроцессорВывода.ЗакончитьВывод();
	
	// Заполняем настройки печати	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, ЭтотОбъект.Метаданные().ПолноеИмя());
	
	// Фиксируем результат формирования отчета  
	ЭтотОбъект.ОтчетСодержитДанные = (РезультатПроверки = РезультатУспешно);
	
	// Завершаем сессию
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры
